print("hello world!!","你好，世界！！！")

#a代表变量名，=为赋值符，表示把右边的值存到左边的变量
#type（）表示变量的数据类型。print（）在控制台打印。字符串要用“”引起来。
a=11
print(a)
print(type(a))
b="hdkhfkhf"
print(b)
print(type(b))
#[]表示list代表一个列表，可存储多个数据，每个数据之间用“，”隔开。
c=[1,2,3,4]
print(c)
print(type(c))
#（）代表一个元组，可以储存多个数据，每个数据之间用“，”隔开。
d=(1,2,3)
print(d)
print(type(d))
#键值对数据
#{}表示dict 代表一个字典，可以储存多个键值对数据，多个键值对数据之间用“，”隔开，key跟value之间用：隔开
e={"姓名":"李井琛","手机号":"15392597909","性别":"男","年龄":"22"}
print(e)
print(type(e))




#第一组数据，   张三，李四，王五，赵六，钱七
a=["张三","李四","王五","赵六","钱七"]
print("a的值是"+str(a))
#第二组数据
b={"姓名":"张三","性别":"女","年龄":18,"科目":"语文","成绩":80}
print("b的值是"+str(b))
#第三组数据
c=["A",2,3,4,5,6,7,8,9,"J","Q","K"]
print("c的值是"+str(c))
#第四组数据
d=10000
print("d的值是"+str(d))
#第五组数据
e="学生"
print("e的值是"+str(e))












#第一组数据，   张三，李四，王五，赵六，钱七
a=["张三","李四","王五","赵六","钱七"]
print(a)
#第二组数据
b={"姓名":"张三","性别":"女","年龄":18,"科目":"语文","成绩":80}
print(b)
#第三组数据
c=["A",2,3,4,5,6,7,8,9,"J","Q","K"]
print(c)
#第四组数据
d=10000
print(d)
#第五组数据
e="学生"
print(e)



a=20

if(a>=10):
    print("小明能卖红双喜")
else:
    print("小明买不起红双喜")
if(a>=5):
    print("小明能买大前门")
else:
    print("小明同学买不起大前门")
if(a>=25):
    print("小明能买玉溪")
else:
    print("小明不能买玉溪")
if(a==20):
    print("小明能买",a/5,"包大前门")

q=18
if(q>=60):
    print("小明应该花150块")
elif(q<18):
    print("小明应该花100块")
else:
    print("小明应该花200块")

